[
    {
      "id": 1,
      "image": "https://i.ibb.co/fkNNmWy/Rectangle-2-2.png",
      "title": "Introduction to C Programming",
      "description": "This course serves as an excellent entry point into the world of programming and software development. You'll embark on a journey to learn one of the most foundational programming languages, C. Known for its simplicity and power, C has been a cornerstone of software development for decades.",
      "price": 149.99,
      "credit": 1
    },
    {
      "id": 2,
      "image": "https://i.ibb.co/HGYJf76/Rectangle-2-3.png",
      "title": "Introduction to Algorithms",
      "description": "This course offers a comprehensive introduction to the fundamental concepts of algorithms, a cornerstone of computer science and problem-solving. Dive into the world of algorithmic thinking and gain insights into designing efficient algorithms for a wide range of applications. Master the art of problem-solving in the digital age.",
      "price": 100,
      "credit": 2
    },
    {
      "id": 3,
      "image": "https://i.ibb.co/41K9yJY/Rectangle-2-4.png",
      "title": "Introduction to C++ for DSA",
      "description": "This course is your gateway to mastering C++ programming in the context of Data Structures and Algorithms (DSA). Dive into the world of C++ and explore how it can be leveraged to implement and optimize essential data structures and algorithms. Whether you're preparing for competitive coding or building a strong foundation in computer science, this course equips you with the skills needed to excel in DSA challenges and real-world software development.",
      "price": 89.99,
      "credit": 10
    },
    {
      "id": 4,
      "image": "https://i.ibb.co/q5vMYjZ/Rectangle-3.png",
      "title": "Basic Data Structures",
      "description": "Explore fundamental data structures, including arrays, linked lists, stacks, and queues. Learn to apply them for efficient programming. Perfect for beginners and those looking to reinforce their programming foundations.",
      "price": 69.99,
      "credit": 5
    },
    {
      "id": 5,
      "image": "https://i.ibb.co/nmygXLS/rectangle.png",
      "title": "Introduction to OOP Python",
      "description": "Learn Python's object-oriented programming (OOP) fundamentals. Ideal for Python beginners.Start your programming journey with Python and learn the basics of coding.",
      "price": 110,
      "credit": 5
    },
    {
      "id": 6,
      "image": "https://i.ibb.co/GCMXcqF/Rectangle-2-5.png",
      "title": "Software Engineering",
      "description": "Gain a solid understanding of software engineering principles, methods, and best practices. Perfect for beginners looking to delve into the world of software development and engineering processes.",
      "price": 195,
      "credit": 2
    },
    {
      "id": 7,
      "image": "https://i.ibb.co/mJ7GpSN/Rectangle-3-1.png",
      "title": "AWS, Cloud Computing",
      "description": "Explore cloud computing concepts and get hands-on experience with Amazon Web Services (AWS).Discover the power of Amazon Web Services (AWS) and cloud computing. Perfect for beginners entering the world of cloud technology.",
      "price": 210,
      "credit": 3
    },
    {
      "id": 8,
      "image": "https://i.ibb.co/YWBF1Fc/Rectangle-2-1.png",
      "title": "Database Design and SQL",
      "description": "Learn how to design and manage databases and work with SQL for data manipulation.Master database design and SQL for effective data management. Perfect for beginners in database development and management.",
      "price": 130.99,
      "credit": 2
    },
    {
        "id": 9,
        "image": "https://i.ibb.co/xmLw2rj/Rectangle-2-6.png",
        "title": "Problem-Solving Part",
        "description": "Sharpen your problem-solving skills. Designed for beginners aiming to excel in critical thinking and logic.Enhance your problem-solving abilities. Perfect for beginners.",
        "price": 39.99,
        "credit": 7
    }
]